Autodesk.Revit.UI.IFormaUIMLCallbackProxy.EditorRequestWaitingForDataGraphics(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
pointerLineStart:
The start of the line from the user pointer to the Z plane in the document.
pointerLineEnd:
The end of the line from the user pointer to the Z plane in the document.
Returns:
Terrain intersaction point
Since:
2027

Autodesk.Revit.UI.IFormaUIMLCallbackProxy.CleanEditorData
Since:
2027

Autodesk.Revit.UI.IFormaUIMLCallbackProxy.PrepareEditorData(Autodesk.Revit.DB.Document)
document:
The document.
Since:
2027

Autodesk.Revit.UI.IFormaUIMLCallbackProxy.DataSetInEditor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Boolean)
Called by Revit when a new area was selected for the Forma ML.
document:
The document.
viewId:
The id of the view where the area was set.
areaCenter:
The center of the area that should be evaluated by the Forma ML.
canceled:
True if the user canceled the operation.
Since:
2027